STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval.c
/**
  ******************************************************************************
  * @file    stm32g0c1e_eval.c
  * @author  MCD Application Team
  * @brief   This file provides: a set of firmware functions to manage Leds,
  *          push-button and COM ports
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 STMicroelectronics</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32g0c1e_eval.h"

/** @addtogroup BSP
* @{
*/

/** @addtogroup STM32G0C1E_EVAL
 * @brief This file provides firmware functions to manage Leds, push-buttons,
 *        COM ports, SD card on SPI and temperature sensor (LM75) available on
 *        STM32G0C1E-EV evaluation board from STMicroelectronics.
 * @{
 */

/** @addtogroup STM32G0C1E_EVAL_Common
  * @{
  */

/** @addtogroup STM32G0C1E_EVAL_Private_Constants
 * @{
 */
/* LINK LCD */
#define START_BYTE         0x70
#define SET_INDEX          0x00
#define READ_STATUS        0x01
#define LCD_WRITE_REG      0x02
#define LCD_READ_REG       0x03

/* LINK SD Card */
#define SD_DUMMY_BYTE      0xFF
#define SD_NO_RESPONSE_EXPECTED  0x80

/* Vref voltage level (in mV) */
#define VREFANALOG_VOLTAGE 3300

/* Legacy daughter board detection voltage level (in mV) */
#define DB_LEGACY_DETECT_VOLTAGE 1100

/* UCPD daughter board revB detection voltage level (in mV) */
#define DB_UCPD_A_B_DETECT_VOLTAGE 1650

/* UCPD daughter board rev C detection voltage level (in mV) */
#define DB_UCPD_C_DETECT_VOLTAGE 1320

/**
  * @brief STM32G0C1E EVAL BSP Driver version number
  */
#define __STM32G0C1E_EVAL_BSP_VERSION_MAIN   (0x01U) /*!< [31:24] main version */
#define __STM32G0C1E_EVAL_BSP_VERSION_SUB1   (0x00U) /*!< [23:16] sub1 version */
#define __STM32G0C1E_EVAL_BSP_VERSION_SUB2   (0x00U) /*!< [15:8]  sub2 version */
#define __STM32G0C1E_EVAL_BSP_VERSION_RC     (0x00U) /*!< [7:0]  release candidate */
#define __STM32G0C1E_EVAL_BSP_VERSION         ((__STM32G0C1E_EVAL_BSP_VERSION_MAIN << 24) |\
                                               (__STM32G0C1E_EVAL_BSP_VERSION_SUB1 << 16) |\
                                               (__STM32G0C1E_EVAL_BSP_VERSION_SUB2 << 8 ) |\
                                               (__STM32G0C1E_EVAL_BSP_VERSION_RC))

#if defined(_GUI_INTERFACE)
const uint8_t HWBoardVersionName[] = "STM32G0C1E-EV";
const uint8_t PDTypeName[] = "MB1581B";
#endif /* _GUI_INTERFACE */
/**
  * @}
  */

/** @addtogroup STM32G0C1E_EVAL_Private_Variables
* @{
*/
/**
* @brief LED variables
*/
GPIO_TypeDef* LED_PORT[LEDn] = {
  LED1_GPIO_PORT,
  LED2_GPIO_PORT,
  LED3_GPIO_PORT,
  LED4_GPIO_PORT
};

const uint16_t LED_PIN[LEDn] = {
    LED1_PIN,
    LED2_PIN,
    LED3_PIN,
    LED4_PIN
};

/**
* @brief BUTTON variables
*/
GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {TAMPER_BUTTON_GPIO_PORT};
const uint16_t BUTTON_PIN[BUTTONn] = {TAMPER_BUTTON_PIN};
const uint8_t BUTTON_IRQn[BUTTONn] = {TAMPER_BUTTON_EXTI_IRQn};

/**
* @brief JOYSTICK variables
*/
GPIO_TypeDef* JOY_PORT[JOYn] = {
  SEL_JOY_GPIO_PORT,
  DOWN_JOY_GPIO_PORT,
  LEFT_JOY_GPIO_PORT,
  RIGHT_JOY_GPIO_PORT,
  UP_JOY_GPIO_PORT
};

const uint16_t JOY_PIN[JOYn] = {
  SEL_JOY_PIN,
  DOWN_JOY_PIN,
  LEFT_JOY_PIN,
  RIGHT_JOY_PIN,
  UP_JOY_PIN
};

const uint8_t JOY_IRQn[JOYn] = {
  SEL_JOY_EXTI_IRQn,
  DOWN_JOY_EXTI_IRQn,
  LEFT_JOY_EXTI_IRQn,
  RIGHT_JOY_EXTI_IRQn,
  UP_JOY_EXTI_IRQn
};


/**
  * @brief COM variables
  */
#ifdef HAL_UART_MODULE_ENABLED
USART_TypeDef* COM_USART[COMn]  = {EVAL_COM1};

GPIO_TypeDef* COM_TX_PORT[COMn] = {EVAL_COM1_TX_GPIO_PORT};

GPIO_TypeDef* COM_RX_PORT[COMn] = {EVAL_COM1_RX_GPIO_PORT};

const uint16_t COM_TX_PIN[COMn] = {EVAL_COM1_TX_PIN};

const uint16_t COM_RX_PIN[COMn] = {EVAL_COM1_RX_PIN};

const uint16_t COM_TX_AF[COMn]  = {EVAL_COM1_TX_AF};

const uint16_t COM_RX_AF[COMn]  = {EVAL_COM1_RX_AF};

#endif /*HAL_UART_MODULE_ENABLED*/

/**
 * @brief BUS variables
 */
#if defined(HAL_I2C_MODULE_ENABLED)
uint32_t I2c1Timeout = EVAL_I2C1_TIMEOUT_MAX;    /*<! Value of Timeout when I2C1 communication fails */
uint32_t I2c2Timeout = EVAL_I2C2_TIMEOUT_MAX;    /*<! Value of Timeout when I2C2 communication fails */
I2C_HandleTypeDef heval_I2c1 = {0};
I2C_HandleTypeDef heval_I2c2 = {0};
uint8_t I2c1RefCounter = 0;
#endif /* HAL_I2C_MODULE_ENABLED */

#if defined(HAL_SPI_MODULE_ENABLED)
uint32_t SpixTimeout = EVAL_SPIx_TIMEOUT_MAX;    /*<! Value of Timeout when SPI communication fails */
static SPI_HandleTypeDef heval_Spi;
#endif /* HAL_SPI_MODULE_ENABLED */

/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_BUS_Operations_Functions BUS Operations Functions
  * @{
  */
#if defined(HAL_I2C_MODULE_ENABLED)
/* I2Cx bus function */
/* Link function for I2C TSENSOR & HDMI_SOURCE peripherals */
static HAL_StatusTypeDef  I2C1_Init(void);
static void               I2C1_DeInit(void);
static void               I2C1_Error (void);
static void               I2C1_MspInit(I2C_HandleTypeDef *hi2c);
/* Link function for I2C TSENSOR peripheral */
static HAL_StatusTypeDef  I2C1_WriteBuffer(uint16_t Addr, uint8_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length);
static HAL_StatusTypeDef  I2C1_ReadBuffer(uint16_t Addr, uint8_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length);
static HAL_StatusTypeDef  I2C1_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);
/* Link function for HDMI_SOURCE peripheral */
static HAL_StatusTypeDef  I2C1_TransmitData(uint8_t *pBuffer, uint16_t Length);

/* Link function for I2C HDMI_SINK peripherals */
static void               I2C2_Init(void);
static void               I2C2_Error(void);
static void               I2C2_MspInit(I2C_HandleTypeDef *hi2c);
/* Link function for HDMI_SINK peripheral */
static HAL_StatusTypeDef  I2C2_ReceiveData(uint16_t Addr, uint8_t * pBuffer, uint16_t Length);

/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_LINK_Operations_Functions LINK Operations Functions
  * @{
  */

/* Link functions for Temperature Sensor peripheral */
void                      TSENSOR_IO_Init(void);
void                      TSENSOR_IO_Write(uint16_t DevAddress, uint8_t* pBuffer, uint8_t WriteAddr, uint16_t Length);
void                      TSENSOR_IO_Read(uint16_t DevAddress, uint8_t* pBuffer, uint8_t ReadAddr, uint16_t Length);
uint16_t                  TSENSOR_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);

/* Link functions for CEC peripheral */
void                      HDMI_CEC_IO_Init(void);
HAL_StatusTypeDef         HDMI_CEC_IO_WriteData(uint8_t * pBuffer, uint16_t BufferSize);
HAL_StatusTypeDef         HDMI_CEC_IO_ReadData(uint16_t DevAddress, uint8_t * pBuffer, uint16_t BufferSize);

/* Link functions for USB Type-C mux peripheral */
uint8_t                   MUX_IO_Init(void);
void                      MUX_IO_DeInit(void);
uint8_t                   MUX_IO_Write(uint16_t Addr, uint16_t Reg, uint8_t Data);
uint8_t                   MUX_IO_Read(uint16_t Addr, uint16_t Reg, uint8_t *pData);
uint32_t                  MUX_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);

